---
title: LossFactor
classe: Autodesk.Revit.DB.Lighting.LossFactor
namespace: Autodesk.Revit.DB.Lighting
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# LossFactor

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `lossFactor.IsValidObject` | Boolean |
| `Double LossFactorValue { get; }` | `lossFactor.LossFactorValue` | Double |
| `LossFactor Clone()` | `lossFactor.Clone()` | LossFactor |
| `Void Dispose()` | `lossFactor.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```